cis240dl_logwatch.org
#+SETUPFILE: ~/.emacs.d/org-templates/level-0.org
#+TITLE:     Logwatch
#+AUTHOR:    Dennis Kibbe
#+EMAIL:     dennisk@sdf.lonestar.org
#+DATE:      2016-09-19 Mon
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:  http://dkibbe.github.io/index.html 
#+LINK_HOME: http://dkibbe.github.io/index.html
#+XSLT:

* Introduction

  Logwatch is a useful utility to keep you aware of what is happening on your system.  Logwatch installs a cron job which runs Logwatch once a day.  For this assignment you will run Logwatch manually.

* Assignment Objectives

  /After successfully completing this assignment you will be able to:/

  - Install Logwatch.
  - Use Logwatch to monitor the system.

* COMMENT Terms You Should Know

  - Logwatch :: log monitor
  - /etc/logwatch/ :: 

* Preparation

  Should work on either Ubuntu or Fedora.

* Install Logwatch

  Use the package manager for your distribution to install logwatch.

* Run Logwatch

  Logwatch sets up a cron job to run once a day.  For this assignment you will run Logwatch manually.

* What to Submit

  Submit a screenshot of the output of =logwatch --detail low --service sshd --range Today=.

* Resources

  - [[http://www.linux-mag.com/id/7800/][From the Sys Admin Toolbox: Logwatch]]
  - [[https://www.digitalocean.com/community/tutorials/how-to-install-and-use-logwatch-log-analyzer-and-reporter-on-a-vps][How To Install and Use Logwatch Log Analyzer and Reporter on a VPS]]
  - [[https://linux.die.net/man/8/logwatch][logwatch(8) - Linux man page]]
