cis240dl_logwatch.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Logwatch</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Logwatch"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2016-09-19 Mon"/>
<meta name="author" content="Dennis Kibbe"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="http://www.w3.org/StyleSheets/Core/Oldstyle.css" /> 

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Logwatch</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction</a></li>
<li><a href="#sec-2">2 Assignment Objectives</a></li>
<li><a href="#sec-3">3 Preparation</a></li>
<li><a href="#sec-4">4 Install Logwatch</a></li>
<li><a href="#sec-5">5 Run Logwatch</a></li>
<li><a href="#sec-6">6 What to Submit</a></li>
<li><a href="#sec-7">7 Resources</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">


<p>
  Logwatch is a useful utility to keep you aware of what is happening on your system.  Logwatch installs a cron job which runs Logwatch once a day.  For this assignment you will run Logwatch manually.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Assignment Objectives</h2>
<div class="outline-text-2" id="text-2">


<p>
  <i>After successfully completing this assignment you will be able to:</i>
</p>
<ul>
<li>Install Logwatch.
</li>
<li>Use Logwatch to monitor the system.
</li>
</ul>




</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Preparation</h2>
<div class="outline-text-2" id="text-3">


<p>
  Should work on either Ubuntu or Fedora.
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Install Logwatch</h2>
<div class="outline-text-2" id="text-4">


<p>
  Use the package manager for your distribution to install logwatch.
</p>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Run Logwatch</h2>
<div class="outline-text-2" id="text-5">


<p>
  Logwatch sets up a cron job to run once a day.  For this assignment you will run Logwatch manually.
</p>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> What to Submit</h2>
<div class="outline-text-2" id="text-6">


<p>
  Submit a screenshot of the output of <code>logwatch --detail low --service sshd --range Today</code>.
</p>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Resources</h2>
<div class="outline-text-2" id="text-7">


<ul>
<li><a href="http://www.linux-mag.com/id/7800/">From the Sys Admin Toolbox: Logwatch</a>
</li>
<li><a href="https://www.digitalocean.com/community/tutorials/how-to-install-and-use-logwatch-log-analyzer-and-reporter-on-a-vps">How To Install and Use Logwatch Log Analyzer and Reporter on a VPS</a>
</li>
<li><a href="https://linux.die.net/man/8/logwatch">logwatch(8) - Linux man page</a>
</li>
</ul>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2016-09-19 Mon</p>
<p class="author">Author: Dennis Kibbe</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
